#### LinkOriginFileType Enumeration

---

|  |
| --- |
| See Also |

Enum determining whether the source type of a temporary rvt link is an ifc.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public enum LinkOriginFileType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration LinkOriginFileType ``` |

| Visual C++ |
| --- |
| ``` public enum class LinkOriginFileType ``` |

# Members

| Member name | Description |
| --- | --- |
| RVT | Default RVT, curently only support ifc. |
| IFC | The original link file is an ifc file. |

# See Also

Autodesk.Revit.DB Namespace